# Parameter Type Id Rebar Termination Rotation At End Property

Source: https://www.revitapidocs.com/2026/fa25c8c9-78c7-cbd4-43dd-3ed7d87a2cd4.htm

---

| Parameter Type Id Rebar Termination Rotation At End Property |
| --- |

"Rotation At End"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarTerminationRotationAtEnd { get; }
```

```
Public Shared ReadOnly Property RebarTerminationRotationAtEnd As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarTerminationRotationAtEnd {
	ForgeTypeId^ get ();
}
```

```
static member RebarTerminationRotationAtEnd : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace